; ====================================================================================================
;
; game_over.asm
;
; include from main.asm
;
; ====================================================================================================
SECTION code_user

; ====================================================================================================
; ゲームオーバー
; ====================================================================================================
GAME_OVER:
    ; ■初回のみの処理実行
    JR Z,GAME_OVER_INIT

    ; ■TICKが300カウント(=5秒)経過してなければ抜ける
    LD BC,300
    LD HL,(TICK1)    
    SBC HL,BC
    JR NZ,GAME_OVER_EXIT

    ; ■ゲーム状態変更
    LD A,STATE_TITLE                ; ゲーム状態をタイトルへ
    CALL CHANGE_STATE

GAME_OVER_EXIT:
    RET

; ---------------------------------------------------------------------------------------------------
; ゲームオーバー初回処理
; ---------------------------------------------------------------------------------------------------
GAME_OVER_INIT:
    ; ■スプライトキャラクターワークテーブル初期化
    CALL INIT_SPR_CHR_WK_TBL

    ; ■オフスクリーン初期化
    CALL CLEAR_OFFSCREEN

    ; ■ゲームオーバーメッセージ表示
    LD HL,STRING_GAME_OVER
    CALL PRTSTR

    ; ■BGM再生
    LD HL,_07
    CALL SOUNDDRV_BGMPLAY

GAME_OVER_INIT_EXIT:
    RET

SECTION rodata_user
; ====================================================================================================
; 定数エリア
; romに格納される
; ====================================================================================================

STRING_GAME_OVER:
    DW $012B
	DB "GAME OVER",0
