; ====================================================================================================
;
; game_global_rodata.asm
;
; included from game.asm
;
; ====================================================================================================

SECTION rodata_user
; ====================================================================================================
; 定数エリア
; romに格納される
; ====================================================================================================

; ■マップデータテーブル
MAP_TBL:
    DW MAP_ROUND1
    DW $0000


; ■マップデータ
MAP_ROUND1:
    DB 0
    DB 0,1,1,2,0,0,0,1,1,0,0,0,0,1,1,1
    DB 1,1,0,0,0,0,0,2,2,0,0,0,0,1,1,1
    DB 1,1,1,0,0,0,0,1,1,0,0,0,0,1,1,1
    DB 1,1,1,1,1,0,0,1,1,0,0,0,0,1,1,1
    DB 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1
    DB 1,1,2,2,2,1,1,1,1,1,1,1,1,1,1,1
    DB 1,1,1,1,1,1,1,1,1,1,1,2,2,2,1,1
    DB 1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1
    DB 1,1,1,0,0,0,0,1,1,0,0,0,0,1,1,1
    DB 1,1,1,0,0,0,1,1,1,1,0,0,0,0,1,1
    DB 1,1,1,0,0,0,1,1,3,1,0,0,2,1,1,0
    DB $FF


; ■プレイヤー初期位置テーブル
PLAYER_INIT_TBL:
    DW PLAYER_INIT_ROUND1
    DW $0000

; ■プレイヤー初期位置データ
PLAYER_INIT_ROUND1:
    DB $A0,$78,$01


; ■敵出現パターンテーブル
ENEMY_PTN_TBL:
    DW ENEMY_PTN_ROUND1
    DW $0000

; ■敵出現パターンデータ
; 2byte : 出現カウント ($0000 = ラウンド開始時に出現, $FFFF = 終端)
; 1byte : 敵の種類（キャラクター番号）
; 1byte : 敵のY座標 (整数値, $FF=ランダムに設定)
; 1byte : 敵のX座標 (整数値, $FF=ランダムに設定)
; 1byte : 移動方向 ($01〜$08、$00=移動しない、$FF=ランダムに設定)
; 2byte : 予備
ENEMY_PTN_ROUND1:
    DW $0000
    DB CHRNO_ENEMY1, $20, $30, $08, $00, $00
    DW $0000
    DB CHRNO_ENEMY1, $20, $C0, $02, $00, $00
    DW $0000
    DB CHRNO_ENEMY1, $90, $30, $06, $00, $00
    DW $0000
    DB CHRNO_ENEMY1, $90, $C0, $04, $00, $00
    DW $0200
    DB CHRNO_ENEMY1, $FF, $FF, $FF, $00, $00
    DW $0200
    DB CHRNO_ENEMY1, $FF, $FF, $FF, $00, $00
    DW $0200
    DB CHRNO_ENEMY1, $FF, $FF, $FF, $00, $00
    DW $0200
    DB CHRNO_ENEMY1, $FF, $FF, $FF, $00, $00
    DW $FFFF
    DB $00, $FF, $FF, $FF, $00, $00


; ■チップセットテーブル
CHIPSET_TBL:
    DW CHIPSET_1
    DW CHIPSET_2
    DW CHIPSET_3
    DW CHIPSET_4

; ■チップセットデータ
CHIPSET_1:
    DB $20, $20, $20, $20
    DB $60, $61, $62, $63
    DB $64, $65, $66, $67
    DB $69, $6A, $6B, $6C
    DB $68, $68, $00, $00

CHIPSET_2:
    DB $20, $20, $20, $20
    DB $70, $71, $72, $73
    DB $74, $75, $76, $77
    DB $79, $7A, $7B, $7C
    DB $78, $78, $00, $00

CHIPSET_3:
    DB $20, $20, $20, $20
    DB $80, $81, $82, $83
    DB $84, $85, $86, $87
    DB $89, $8A, $8B, $8C
    DB $88, $88, $00, $00

CHIPSET_4:
    DB $20, $20, $20, $20
    DB $90, $91, $92, $93
    DB $94, $95, $96, $97
    DB $99, $9A, $9B, $9C
    DB $98, $98, $00, $00


; ■BGMテーブル
BGM_TBL:
    DW _02
    DW _03
    DW _04
    DW _05
