; ====================================================================================================
;
; game_global_bss.asm
;
; included from game.asm
;
; ====================================================================================================

SECTION bss_user
; ====================================================================================================
; ワークエリア
; プログラム起動時にcrtでゼロでramに設定される 
; ====================================================================================================

; ■ゲーム状態
GAME_STATE:
    DEFS 1

; ■ラウンド
ROUND:
    DEFS 1

; ■ラウンド数(BCD値)
ROUND_BCD:
    DEFS 1

; ■スコア
SCORE:
    DEFS 3

; ■スコア加算値(BCD)
SCORE_ADDVALUE_BCD:
    DEFS 1

; ■ハイスコア
HISCORE:
    DEFS 3

; ■ターゲット残り
TARGET_LEFT:
    DEFS 1

; ■残機
LEFT:
    DEFS 1
