; ====================================================================================================
;
; game_main.asm
;
; include from game.asm
;
; ====================================================================================================
SECTION code_user

; ====================================================================================================
; ゲームメイン
; ====================================================================================================
GAME_MAIN:
    ; ■テキ出現制御処理を呼び出す
    CALL ENEMY_APPEARANCE_CTRL

    ; ■スプライトキャラクターワークテーブルの全ての要素に対して繰り返し
    LD B,MAX_CHR_CNT

GAME_MAIN_L1:
    ; ■対象のキャラクター番号からスプライトキャラクターワークテーブルのアドレスを取得
    LD A,B
;    SUB 1
    CALL GET_SPR_WK_ADDR            ; IX <- 対象のスプライトキャラクターワークテーブルのアドレス

    ; ■BCレジスタをスタックに退避
    PUSH BC

    ; ■対象のキャラクター番号からキャラクターロジックテーブルのアドレスを取得
    LD A,(IX)                       ; A <- キャラクター番号
    OR A
    JR Z,GAME_MAIN_L2               ; ゼロの場合はGAME_MAIN_L2へ
    SUB 1
    LD HL,CHARACTER_UPDATE_TABLE    ; HL <- キャラクターロジックテーブルのアドレス
    CALL TBL_JP

GAME_MAIN_L2:
    ; ■BCレジスタをスタックから復元 
    POP BC

    DJNZ GAME_MAIN_L1

GAME_MAIN_EXIT:
    RET
