; ====================================================================================================
;
; game_round_start.asm
;
; include from game.asm
;
; ====================================================================================================
SECTION code_user

; ====================================================================================================
; ラウンド開始
; ====================================================================================================
ROUND_START:
    ; ■初回のみの処理実行
    JR Z,ROUND_START_INIT

    ; ■TICKが240カウント(=4秒)経過してなければ抜ける
    LD BC,240
    LD HL,(TICK1)    
    SBC HL,BC
    JR NZ,ROUND_START_EXIT

    ; ■マップデータをワークにコピー
    LD A,(ROUND)
    CALL COPY_MAP_DATA

    ; ■オフスクリーンリセット
    CALL RESET_OFFSCREEN

    ; ■オフスクリーン描画
    CALL DRAW_MAP

    ; ■スプライトキャラクターワークテーブル初期化
    CALL INIT_SPR_CHR_WK_TBL

    ; ■プレイヤー初期化
    ; @ToDo:マップデータの後に、プレイヤーの初期情報を置いて、そこから設定するようにしたい
    LD A,2
    CALL ADD_CHARACTER
    LD A,1
    CALL ADD_CHARACTER

    ; ■敵初期化
    ; @ToDo:マップデータの後に、敵の初期情報を置いて、そこから設定するようにしたい
;    LD B,5                          ; 敵の数
ROUND_START_L1:
;    LD A,2                          ; 2＝テキ1
;    CALL ADD_CHARACTER
;    DJNZ ROUND_START_L1             ; 敵の数だけ繰り返す

;    LD B,5                          ; 敵の数
ROUND_START_L2:
;    LD A,3                          ; 3＝テキ2
;    CALL ADD_CHARACTER
;    DJNZ ROUND_START_L2             ; 敵の数だけ繰り返す

    ; ■ゲーム状態変更
    LD A,STATE_GAME_MAIN            ; ゲーム状態をゲームメインへ
    CALL CHANGE_STATE

    ; ■BGM再生
;    LD HL,_02
    LD HL,(BGM_WK)
    CALL SOUNDDRV_BGMPLAY

ROUND_START_EXIT:
    RET

; ----------------------------------------------------------------------------------------------------
; ラウンド開始時の初回処理
; ----------------------------------------------------------------------------------------------------
ROUND_START_INIT:
    ; ■スプライトキャラクターワークテーブル初期化
    CALL INIT_SPR_CHR_WK_TBL

    ; ■オフスクリーンリセット
    CALL RESET_OFFSCREEN

    ; ■ラウンド数をBCD変換してワークに設定
    LD A,(ROUND)
    DAA
    LD (BCD_ROUND_NO),A

    ; ■ラウンド開始メッセージ表示
    LD HL,STRING_ROUND_START
    CALL PRTSTR

    LD B,1
    LD DE,BCD_ROUND_NO
    LD HL,$0115
    CALL PRTBCD

    ; ■BGM再生
    LD HL,_01
    CALL SOUNDDRV_BGMPLAY

    RET

SECTION rodata_user
; ====================================================================================================
; 定数エリア
; romに格納される
; ====================================================================================================

STRING_ROUND_START:
    DW $0109
	DB "READY ROUND",0

SECTION bss_user
; ====================================================================================================
; ワークエリア
; プログラム起動時にcrtでゼロでramに設定される 
; ====================================================================================================

; ■ラウンド数（BCD値）
BCD_ROUND_NO:
    DEFS 1
