; ====================================================================================================
;
; game_init.asm
;
; included from main.asm
;
; ====================================================================================================
SECTION code_user

; ====================================================================================================
; ゲーム初期化
; ====================================================================================================
GAME_INIT:
    ; ■乱数初期化
    CALL INIT_RND

    ; ■各変数初期化
    LD A,1
    LD (ROUND),A                    ; ラウンド数 <- 1
    LD A,0
    LD IX,SCORE
    LD (IX),A                       ; スコア <- 0
    LD (IX+1),A
    LD (IX+2),A
    LD A,2
    LD (LEFT),A                     ; 残機 <- 2

    ; ToDo : ここで固定表示される文字列もオフスクリーンに設定しておく？

    ; ■ゲーム状態変更
    LD A,STATE_ROUND_START          ; ゲーム状態 <- ラウンド開始
    CALL CHANGE_STATE

GAME_INIT_EXIT:
    RET
