; ====================================================================================================
;
; score.asm
;
; included from sprite.asm
;
; ====================================================================================================
SECTION code_user

CHRNO_SCORE:                        EQU 4       ; キャラクター番号

; ■スコアの点滅時間
SCORE_FLASHING_CNT:                 EQU $20

; ====================================================================================================
; 取得スコア初期化
; ====================================================================================================
INIT_SCORE:

    ; ■プレイヤーの座標の参照アドレスを取得
    PUSH IX
    LD A,1                          ; IX <- プレイヤーのワークアドレス
    CALL GET_SPR_WK_ADDR
    PUSH IX
    POP HL                          ; IX(転送元アドレス) -> HL
    POP IX

    LD (IX),CHRNO_SCORE             ; キャラクター番号=スコア

    INC HL
    INC HL
    LD A,(HL)
    LD (IX+1),0                     ; Y座標(小数部)
    LD (IX+2),A                     ; Y座標(整数部)

    INC HL
    INC HL
    LD A,(HL)
    SUB 8
    LD (IX+3),0                     ; X座標(小数部)
    LD (IX+4),A                     ; X座標(整数部)

    LD A,(SCORE_CHRNO)
    ADD A,28
    LD (IX+5),A                     ; スプライトパターンNo
    LD (IX+6),15                    ; カラーコード

    LD (IX+7),1                     ; 移動方向
    LD (IX+8),$FF                   ; 移動量
;    LD (IX+9),0                     ; アニメーションテーブルアドレス
;    LD (IX+10),0                    ; アニメーションテーブルアドレス
;    LD (IX+11),0                    ; アニメーションカウンタ
;    LD (IX+12),SCORE_FLASHING_CNT   ; 点滅時間
    LD (IX+12),0                    ; 点滅時間
    LD (IX+13),SCORE_FLASHING_CNT   ; 移動時間

    RET

; ====================================================================================================
; 獲得スコア処理
; ====================================================================================================
UPDATE_SCORE:

    CALL SPRITE_MOVE                ; スプライトキャラクター移動処理

    ; ■点滅を終えたか
;    LD A,(IX+12)
;    OR A
;    RET NZ

    LD A,(IX+13)
    DEC A
    LD (IX+13),A
    OR A
    RET NZ

    ; ■点滅を終えた場合、自分自身を除去する
    CALL DEL_CHARACTER

    RET


; ====================================================================================================
; ワークエリア
; プログラム起動時にcrtでゼロでramに設定される 
; ====================================================================================================
SECTION bss_user

; ■スコアのキャラクター番号
SCORE_CHRNO:
    DEFS 1
